import React from "react";
import "./style.scss"

class Home extends React.Component<any, any>{

    render() {
        return (
            <>
                <header>
                    <span className={"line-text"}>Programmers’ Day CO2ding</span>
                    <img src={"./assets/header-img.svg"} alt={"header-img"}/>
                    <div>
                        <h1>Завдання</h1>
                        <p>Створити  інтерактивний  веб  застосунок  для  візуалізації  та  поліпшення  аналізу
                            викидів парникових газів.<br/> <br/>Що буде включати головну та набір спеціалізованих сторінок.
                            Які повинні презентувати надані нижче данні викидів у формі діаграм. <br/><br/>Поведінка котрих
                            має  включати  елементи  інтерактивності,  за  допомогою  яких  можна  змінювати
                            відображення  статистики  по  викидах  за  регіонами,  роками,  а  також  кількості  зелених
                            насаджень,  щоб  нівелювати  задану  шкоду  атмосфері.  <br/><br/>Фільтрація  та
                            сортування даних буде плюсом.  Данні  для  діаграм  повинні  надходити  з  серверної
                            частини застосунку, реалізованої як REST за наданою нижче специфікацією.</p>
                        <a href={"#team"}>Про команду</a>
                    </div>
                </header>
                <section id="team">
                    <div>
                        <h1>JWP | FrontEnd</h1>
                        <p>Команда JWP - це команда з ентузіастів в усіх сверах ІТ. Від менеджменту до розробки застосунків використовуючи популярні та актуальні технології.
                            <br/><br/>У вільний від проектів час ми полюбляємо брати участь в різних хакатонах, турніра та змаганнях з програмування.
                            <br/><br/>Цього турніру ми вирішили випробувати свої сили по одинці тому розділились на бекенд та фронт енд команди.
                        </p>
                    </div>
                    <img src={"./assets/team.jpg"} alt={"team"}/>
                </section>
            </>
        );
    }
}

export default Home